app/views/book/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = $1  [["book_id", 1]]
---
<% @book.reviews.each do |review| %>