app/controllers/book_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
---
  def show
    @book = Book.includes(reviews: :user).find(params[:id])